In [1]:
!cat pydata-book/examples/ex1.csv

cat: pydata-book/examples/ex1.csv: No such file or directory

In [2]:
!cat pydata-book-2nd-edition/examples/ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [1]:
import pandas as pd

In [2]:
import numpy as np

In [4]:
df = pd.read_csv('pydata-book-2nd-edition/examples/ex1.csv')

In [5]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [6]:
!cat pydata-book-2nd-edition/examples/ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [7]:
pd.read_csv('pydata-book-2nd-edition/examples/ex2.csv', header = None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [9]:
pd.read_csv('pydata-book-2nd-edition/examples/ex2.csv', names = ['a','b','c','d','message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [10]:
names =  ['a','b','c','d','message']

In [11]:
pd.read_csv('pydata-book-2nd-edition/examples/ex2.csv', names = names, index_col = 'message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [12]:
!cat pydata-book-2nd-edition/examples/csv_mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [13]:
parsed = pd.read_csv('pydata-book-2nd-edition/examples/csv_mindex.csv', index_col = ['key1','key2'])

In [14]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [15]:
list(open('pydata-book-2nd-edition/examples/ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [16]:
result = pd.read_csv('pydata-book-2nd-edition/examples/ex3.txt', sep = '\s+')

In [17]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [18]:
!cat pydata-book-2nd-edition/examples/ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [19]:
pd.read_csv('pydata-book-2nd-edition/examples/ex4.csv', skiprows = [0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [20]:
!cat pydata-book-2nd-edition/examples/ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [21]:
result = pd.read_csv('pydata-book-2nd-edition/examples/ex5.csv')

In [22]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [23]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [28]:
result = pd.read_csv('pydata-book-2nd-edition/examples/ex5.csv', na_values = ['NULL'])

In [25]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [29]:
sentinels = {'message':['foo', 'NA'], 'something':['two']}

In [30]:
pd.read_csv('pydata-book-2nd-edition/examples/ex5.csv', na_values = sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

In [1]:
###Writing Data to Text Format

In [5]:
data = pd.read_csv('pydata-book-2nd-edition/examples/ex5.csv')

In [6]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [7]:
data.to_csv('pydata-book-2nd-edition/examples/out.csv')

In [8]:
!cat pydata-book-2nd-edition/examples/out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [9]:
import sys

In [10]:
data.to_csv(sys.stdout, sep= '|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [11]:
data.to_csv(sys.stdout, na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [12]:
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [13]:
data.to_csv(sys.stdout, index=False, columns=['a','b','c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [14]:
dates = pd.date_range('1/1/2000', periods=7)

In [15]:
import numpy as np

In [16]:
ts = pd.Series(np.arange(7), index=dates)

In [17]:
ts.to_csv('pydata-book-2nd-edition/examples/tseries.csv')

In [18]:
!cat pydata-book-2nd-edition/examples/tseries.csv

2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

In [19]:
###Working with Delminated Formats

In [20]:
!cat pydata-book-2nd-edition/examples/ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [4]:
import csv
f = open('pydata-book-2nd-edition/examples/ex7.csv')
reader = csv.reader(f)

In [5]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [6]:
reader

In [7]:
with open('pydata-book-2nd-edition/examples/ex7.csv') as f:
    lines = list(csv.reader(f))

In [8]:
header, values = lines[0], lines[1:]

In [9]:
data_dict = {h: v for h, v in zip(header, zip(*values))}

In [10]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [2]:
list(zip(*values))

NameError: name 'values' is not defined

In [39]:
class my_dialect(csv.Dialect):
    lineterminator = '\n'
    delimiter = ';'
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL
    reader = csv.reader(f, dialect = my_dialect)

TypeError: argument 1 must be an iterator

In [38]:
reader = csv.reader(f, dialect = my_dialect)

TypeError: argument 1 must be an iterator

In [ ]:
with open('mydata.csv', 'w') as f:
    writer = csv.writer(f, dialect = my_dialect)
    writer.writerow(('one', 'two', 'three'))
    writer.writerow(('1','2','3'))
    writer.writerow(('4','5','6'))
    writer.writerow(('7','8','9'))

In [1]:
####JSON Data

In [2]:
import json

In [4]:
obj = """
{"name": "Wes",
 "places_lived": ["United States", "Spain", "Germany"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
              {"name": "Katie", "age": 38,
               "pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [5]:
result = json.loads(obj)

In [6]:
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [7]:
asjson = json.dumps(result)

In [9]:
asjson

'{"name": "Wes", "places_lived": ["United States", "Spain", "Germany"], "pet": null, "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]}, {"name": "Katie", "age": 38, "pets": ["Sixes", "Stache", "Cisco"]}]}'

In [10]:
siblings = pd.DataFrame(result['siblings'], columns = ['name','age'])

In [12]:
siblings

    name  age
0  Scott   30
1  Katie   38

In [13]:
!cat pydata-book-2nd-edition/examples/example.json

[{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

In [14]:
data = pd.read_json('pydata-book-2nd-edition/examples/example.json')

In [15]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [16]:
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [17]:
print(data.to_json(orient = 'records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

In [18]:
###XML and HTML: Web Scraping

In [19]:
tables = pd.read_html('pydata-book-2nd-edition/examples/fdic_failed_bank_list.html')

In [20]:
len(tables)

1

In [21]:
failures = tables[0]

In [22]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [23]:
close_timestamps = pd.to_datetime(failures['Closing Date'])

In [24]:
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
2013     24
2014     18
2002     11
2015      8
2016      5
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, dtype: int64

In [25]:
from lxml import objectify

In [31]:
path = 'pydata-book-2nd-edition/datasets/mta_perf/Performance_MNR.xml'
parsed = objectify.parse(open(path))
root = parsed.getroot()

In [27]:
parsed = objectify.parse(open(path))

In [28]:
root = parsed.getroot()

In [34]:
data = []

In [33]:
skip_fields = ['PARENT_SEQ', 'INDICATOR_SEQ',
               'DESIRED_CHANGE', 'DECIMAL_PLACES']

In [35]:
for elt in root.INDICATOR:
    el_data = {}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
        el_data[child.tag] = child.pyval
    data.append(el_data)

In [36]:
el_data

{'AGENCY_NAME': 'Metro-North Railroad',
 'INDICATOR_NAME': 'Escalator Availability',
 'DESCRIPTION': 'Percent of the time that escalators are operational systemwide. The availability rate is based on physical observations performed the morning of regular business days only. This is a new indicator the agency began reporting in 2009.',
 'PERIOD_YEAR': 2011,
 'PERIOD_MONTH': 12,
 'CATEGORY': 'Service Indicators',
 'FREQUENCY': 'M',
 'INDICATOR_UNIT': '%',
 'YTD_TARGET': 97.0,
 'YTD_ACTUAL': '',
 'MONTHLY_TARGET': 97.0,
 'MONTHLY_ACTUAL': ''}

In [37]:
perf = pd.DataFrame(data)

In [38]:
perf.head()

,AGENCY_NAME,CATEGORY,DESCRIPTION,FREQUENCY,INDICATOR_NAME,INDICATOR_UNIT,MONTHLY_ACTUAL,MONTHLY_TARGET,PERIOD_MONTH,PERIOD_YEAR,YTD_ACTUAL,YTD_TARGET
0,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,M,On-Time Performance (West of Hudson),%,96.9,95,1,2008,96.9,95
1,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,M,On-Time Performance (West of Hudson),%,95,95,2,2008,96,95
2,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,M,On-Time Performance (West of Hudson),%,96.9,95,3,2008,96.3,95
3,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,M,On-Time Performance (West of Hudson),%,98.3,95,4,2008,96.8,95
4,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,M,On-Time Performance (West of Hudson),%,95.8,95,5,2008,96.6,95

In [39]:
from io import StringIO
tag = '<a href="http://www.google.com">Google</a>'
root = objectify.parse(StringIO(tag)).getroot()

In [41]:
root

In [42]:
root.get('href')

'http://www.google.com'

In [43]:
root.text

'Google'

In [44]:
###Min-Yao

In [45]:
food = pd.read_json('pydata-book-2nd-edition/datasets/usda_food/database.json')

In [46]:
food.head(5)

,description,group,id,manufacturer,nutrients,portions,tags
0,"Cheese, caraway",Dairy and Egg Products,1008,,"[{'value': 25.18, 'units': 'g', 'description':...","[{'amount': 1, 'unit': 'oz', 'grams': 28.35}]",[]
1,"Cheese, cheddar",Dairy and Egg Products,1009,,"[{'value': 24.9, 'units': 'g', 'description': ...","[{'amount': 1, 'unit': 'cup, diced', 'grams': ...",[]
2,"Cheese, edam",Dairy and Egg Products,1018,,"[{'value': 4.22, 'units': 'g', 'description': ...","[{'amount': 1, 'unit': 'oz', 'grams': 28.35}, ...",[]
3,"Cheese, feta",Dairy and Egg Products,1019,,"[{'value': 5.2, 'units': 'g', 'description': '...","[{'amount': 1, 'unit': 'cup, crumbled', 'grams...",[]
4,"Cheese, mozzarella, part skim milk",Dairy and Egg Products,1028,,"[{'value': 3.27, 'units': 'g', 'description': ...","[{'amount': 1, 'unit': 'oz', 'grams': 28.35}]",[]

In [3]:
###6.2 Binary Data Formats

In [4]:
frame = pd.read_csv('./pydata-book-2nd-edition/examples/ex1.csv')

In [5]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [6]:
frame.to_pickle('pydata-book-2nd-edition/examples/frame_pickle')

In [7]:
pd.read_pickle('pydata-book-2nd-edition/examples/frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [8]:
frame = pd.DataFrame({'a':np.random.randn(100)})

In [9]:
frame

           a
0   0.646944
1  -0.422873
2   0.748155
3  -1.839710
4  -1.158217
5  -0.089408
6  -0.270846
7  -2.404591
8   0.594080
9  -0.182463
10  0.769997
11 -0.097123
12 -0.139609
13 -0.119617
14 -0.689406
15 -0.790304
16  0.603247
17  1.068308
18 -0.023837
19  1.342814
20  0.358919
21  1.342287
22 -0.730161
23 -0.551905
24 -1.065989
25 -0.321180
26  0.222544
27 -1.114840
28 -0.758766
29  0.316180
..       ...
70 -0.376410
71  1.033242
72 -0.999595
73  1.079295
74  0.463840
75  0.535438
76  0.351136
77  0.821566
78 -0.220799
79  0.176787
80 -0.952658
81 -0.596859
82 -0.736472
83  0.773326
84 -1.231938
85  0.048473
86  0.004063
87  0.357284
88 -0.242312
89 -2.204475
90  1.297734
91 -0.989849
92 -0.332002
93 -0.772005
94  0.828389
95 -1.227102
96  0.640478
97  0.193956
98 -0.930067
99 -0.208554

[100 rows x 1 columns]

In [16]:
import tables

In [17]:
store = pd.HDFStore('mydata.h5')

In [18]:
store['obj1'] = frame

In [19]:
store['obj1_col'] = frame['a']

In [20]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [21]:
store['obj1']

           a
0   0.646944
1  -0.422873
2   0.748155
3  -1.839710
4  -1.158217
5  -0.089408
6  -0.270846
7  -2.404591
8   0.594080
9  -0.182463
10  0.769997
11 -0.097123
12 -0.139609
13 -0.119617
14 -0.689406
15 -0.790304
16  0.603247
17  1.068308
18 -0.023837
19  1.342814
20  0.358919
21  1.342287
22 -0.730161
23 -0.551905
24 -1.065989
25 -0.321180
26  0.222544
27 -1.114840
28 -0.758766
29  0.316180
..       ...
70 -0.376410
71  1.033242
72 -0.999595
73  1.079295
74  0.463840
75  0.535438
76  0.351136
77  0.821566
78 -0.220799
79  0.176787
80 -0.952658
81 -0.596859
82 -0.736472
83  0.773326
84 -1.231938
85  0.048473
86  0.004063
87  0.357284
88 -0.242312
89 -2.204475
90  1.297734
91 -0.989849
92 -0.332002
93 -0.772005
94  0.828389
95 -1.227102
96  0.640478
97  0.193956
98 -0.930067
99 -0.208554

[100 rows x 1 columns]

In [22]:
store.put('obj2', frame, format = 'table')

In [23]:
store.select('obj2', where=['index >=10 and index <=15'])

           a
10  0.769997
11 -0.097123
12 -0.139609
13 -0.119617
14 -0.689406
15 -0.790304

In [24]:
store.close()

In [25]:
frame.to_hdf('mydata.h5', 'obj3', format = 'table')

In [27]:
pd.read_hdf('mydata.h5', 'obj3', where=['index < 5'])

          a
0  0.646944
1 -0.422873
2  0.748155
3 -1.839710
4 -1.158217

In [28]:
###Reading Microsoft Excel Files

In [29]:
xlsx = pd.ExcelFile('pydata-book-2nd-edition/examples/ex1.xlsx')

In [31]:
pd.read_excel(xlsx, 'Sheet1')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [32]:
frame = pd.read_excel('pydata-book-2nd-edition/examples/ex1.xlsx', 'Sheet1')

In [33]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [34]:
writer = pd.ExcelWriter('pydata-book-2nd-edition/examples/ex2.xlsx')

In [35]:
frame.to_excel(writer, 'Sheet1')

In [36]:
writer.save()

In [37]:
frame.to_excel('pydata-book-2nd-edition/examples/ex2.xlsx')

In [38]:
####### 6.3 Interacting with Web APIs

In [39]:
import requests

In [40]:
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'

In [41]:
resp = requests.get(url)

In [42]:
resp

In [43]:
data = resp.json()

In [44]:
data[0]['title']

'Adding native support to query azure data explorer'

In [45]:
issues = pd.DataFrame(data, columns=['number','title',
                                    'labels', 'state'])

In [46]:
issues

,number,title,labels,state
0,24818,Adding native support to query azure data expl...,"[{'id': 35818298, 'node_id': 'MDU6TGFiZWwzNTgx...",open
1,24817,SparseDataFrame.to_coo does not convert the de...,[],open
2,24816,Question regarding Series.argsort documentation,[],open
3,24815,BUG: Format mismatch doesn't coerce to NaT,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
4,24814,pandas EWMA documentation possible error,[],open
5,24813,PERF: Avoid MultiIndex conversion for Interval...,"[{'id': 150096370, 'node_id': 'MDU6TGFiZWwxNTA...",open
6,24811,"BUG: Offset-based rolling window, with only on...","[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
7,24809,"str.replace('.','') should replace every chara...","[{'id': 57522093, 'node_id': 'MDU6TGFiZWw1NzUy...",open
8,24808,ENH Series.getattr for attributes lacking buil...,[],open
9,24807,simplification of enhancingperf,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
10,24806,DEPR/API: Non-ns precision in Index constructors,"[{'id': 87485152, 'node_id': 'MDU6TGFiZWw4NzQ4...",open
11,24805,read_csv using C engine and chunksize can grow...,"[{'id': 47229171, 'node_id': 'MDU6TGFiZWw0NzIy...",open
12,24804,"str.replace('.','') should replace every chara...","[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
13,24800,df.index.map with different size fails for Pan...,"[{'id': 71268330, 'node_id': 'MDU6TGFiZWw3MTI2...",open
14,24798,Assigning values breaks in different ways when...,"[{'id': 31404521, 'node_id': 'MDU6TGFiZWwzMTQw...",open
15,24794,read_sas column limit,[],open
16,24788,Timestamp.strftime() has erratic behavior afte...,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
17,24786,df.groupby(df.index) drops index info when df ...,"[{'id': 233160, 'node_id': 'MDU6TGFiZWwyMzMxNj...",open
18,24784,Locators off by one day,[],open
19,24783,Single-level tuple index to multi-level index ...,[],open
20,24782,BUG: DataFrame.merge(suffixes=) does not respe...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
21,24779,python-project-packaging-with-pandas,"[{'id': 129350, 'node_id': 'MDU6TGFiZWwxMjkzNT...",open
22,24778,Python crash with segmentation failure upon im...,"[{'id': 307649777, 'node_id': 'MDU6TGFiZWwzMDc...",open
23,24775,BUG: timedelta64 + Timestamp raises,"[{'id': 47223669, 'node_id': 'MDU6TGFiZWw0NzIy...",open
24,24773,ExtensionArray.astype docstring,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
25,24769,REF/TST: Stop using singleton fixtures,"[{'id': 211029535, 'node_id': 'MDU6TGFiZWwyMTE...",open
26,24768,Concatenating rows with Int64 datatype coerces...,"[{'id': 195647922, 'node_id': 'MDU6TGFiZWwxOTU...",open
27,24767,The feather example from docs segfault with py...,"[{'id': 76865106, 'node_id': 'MDU6TGFiZWw3Njg2...",open
28,24766,read_html ignores paragraphs in table cells,"[{'id': 57395487, 'node_id': 'MDU6TGFiZWw1NzM5...",open
29,24763,Format mismatch doesn't coerce to NaT,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open

In [47]:
#####6.4 Interacting with Databases

In [48]:
import sqlite3

In [55]:
query = """
CREATE TABLE test
(a VAECHAR(20), b VARCHAR(20),
c REAL,          d INTEGER
); """

In [56]:
con = sqlite3.connect('mydata.sqlite')

In [57]:
con.execute(query)

In [58]:
con.commit()

In [59]:
data = [('Atlanta', 'Georgia', 1.25, 6),
        ('Tallahassee', 'Florida', 2.6, 3),
        ('Sacramento', 'California', 1.7, 5)]

In [60]:
stmt = "INSERT INTO test VALUES(?,?,?,?)"

In [61]:
con.executemany(stmt,data)

In [62]:
con.commit()

In [63]:
cursor = con.execute('select * from test')

In [64]:
rows = cursor.fetchall()

In [65]:
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [66]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [67]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [68]:
import sqlalchemy as sqla

In [69]:
db = sqla.create_engine('sqlite:///mydata.sqlite')

In [70]:
pd.read_sql('select * from test', db)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5